{
  "userId": "bangladeshi_user",
  "createdAt": "2025-11-21T10:16:06.477Z",
  "lastActive": "2025-11-21T10:16:37.066Z",
  "preferences": {
    "language": "English",
    "budget": "low",
    "dietaryPreferences": [
      "Vegetarian"
    ],
    "familySize": 5,
    "allergies": [],
    "location": "Bangladesh"
  },
  "inventory": [],
  "conversationHistory": [
    {
      "id": "msg_1763720185495",
      "timestamp": "2025-11-21T10:16:25.495Z",
      "userMessage": "আমার কাছে অনেক ভাত আছে, এটি নষ্ট হচ্ছে",
      "botResponse": "আসসালামু আলাইকুম! আপনার কাছে অনেক ভাত আছে এবং সেটি নষ্ট হওয়ার উপক্রম, জেনে খারাপ লাগলো। চিন্তা করবেন না, ভাত দিয়ে অনেক কিছুই করা যায়, যেন খাবার অপচয় না হয়। যেহেতু আপনার পরিবারের সদস্য সংখ্যা ৫ জন এবং আপনি সাশ্রয়ী মূল্যের খাবারের পরিকল্পনা করতে চান, তাই আমি আপনাকে কিছু পরামর্শ দিতে পারি:\n\n1.  **ভাতের মজাদার রেসিপি:**\n    *   **ভাতের ভর্তা:** পেঁয়াজ, কাঁচামরিচ, ধনে পাতা এবং সামান্য সরিষার তেল দিয়ে ভাত মেখে ভর্তা তৈরি করতে পারেন। এটি খুব সহজেই তৈরি করা যায় এবং খেতেও সুস্বাদু।\n        *   খরচ: ২০-৩০ টাকা (পেঁয়াজ, কাঁচামরিচ, ধনে পাতা এবং সরিষার তেল)।\n        *   পরিবেশের প্রভাব: খাবার অপচয় রোধ করে পরিবেশের উপর ইতিবাচক প্রভাব ফেলে।\n    *   **ফ্রাইড রাইস:** ডিম এবং সবজি (গাজর, মটরশুঁটি, ক্যাপসিকাম) দিয়ে ফ্রাইড রাইস তৈরি করতে পারেন।\n        *   খরচ: ৫০-৭০ টাকা (ডিম এবং সবজি)।\n        *   পুষ্টিগুণ: সবজি থাকার কারণে এটি স্বাস্থ্যকর।\n\n2.  **ভাত সংরক্ষণের উপায়:**\n    *   বাকি ভাত ঠান্ডা করে এয়ার টাইট পাত্রে ভরে ফ্রিজে রেখে দিন। এটি ২-৩ দিন পর্যন্ত ভালো থাকবে।\n    *   ফ্রিজের ভাত গরম করার সময় সামান্য পানি ছিটিয়ে গরম করুন, এতে ভাত ঝরঝরে থাকবে।\n\n3.  **সাশ্রয়ী মূল্যের খাবার:**\n    *   যেহেতু আপনার SDG স্কোর ৫০/১০০, তাই আমি আপনাকে সাশ্রয়ী মূল্যের কিছু খাবারের তালিকা দিতে পারি, যা আপনার পরিবারের জন্য পুষ্টিকর হবে।\n    *   ডাল, ডিম, এবং স্থানীয় সবজি আপনার খাদ্য তালিকায় যোগ করতে পারেন।\n\n4.  **আমার কাছ থেকে আপনি যা জানতে পারেন:**\n    *   \"কীভাবে খাবার সংরক্ষণ করতে হয়?\"\n    *   \"সাশ্রয়ী মূল্যের খাবারের তালিকা\"\n    *   \"ভাতের অপচয় রোধে বিভিন্ন রেসিপি\"\n\nআশা করি এই পরামর্শগুলো আপনার উপকারে আসবে। যদি আপনার অন্য কোনো প্রশ্ন থাকে, তবে জিজ্ঞাসা করতে দ্বিধা করবেন না।",
      "intent": "general",
      "userPreferences": {
        "language": "English",
        "budget": "low",
        "dietaryPreferences": [
          "Vegetarian"
        ],
        "familySize": 5,
        "allergies": [],
        "location": "Bangladesh"
      }
    },
    {
      "id": "msg_1763720197066",
      "timestamp": "2025-11-21T10:16:37.066Z",
      "userMessage": "আমার কাছে অনেক ভাত আছে, এটি নষ্ট হচ্ছে",
      "botResponse": "আস্ সালামু আলাইকুম! আপনার আবার অনেক ভাত বেঁচে গেছে জেনে খারাপ লাগছে। চিন্তা করবেন না, আগের দিন এর ভাতের অনেক ব্যবহার আছে! যেহেতু আপনার পরিবারে ৫ জন সদস্য এবং আপনি ভেজিটেরিয়ান, তাই আমি আপনাকে কিছু সহজ উপায় বলতে পারি যা দিয়ে আপনি ভাত ব্যবহার করতে পারেন এবং খাবার অপচয় কমাতে পারেন:\n\n1.  **সকালের নাস্তার জন্য:**\n    *   **ভাতের পোহা:** পেঁয়াজ, সরিষা, কারি পাতা এবং অল্প কিছু সবজি দিয়ে ভাতের পোহা তৈরি করতে পারেন। এটি মহারাষ্ট্রের একটি জনপ্রিয় খাবার, যা বাংলাদেশেও তৈরি করা যায়।\n        *   খরচ: ৩০-৪০ টাকা (পেঁয়াজ, সরিষা, কারি পাতা এবং সবজি)।\n        *   পুষ্টিগুণ: এটি সহজে হজম হয় এবং কার্বোহাইড্রেট সমৃদ্ধ।\n    *   **উপমা:** সুজি অথবা ভাত দিয়ে উপমা তৈরি করতে পারেন। এটি দক্ষিণ ভারতীয় একটি খাবার।\n        *   খরচ: ২৫-৩৫ টাকা (সুজি/ভাত এবং সবজি)।\n        *   উপকারিতা: স্বাস্থ্যকর এবং সহজে তৈরি করা যায়।\n        *   পরিবেশের প্রভাব: খাবার অপচয় রোধ করে পরিবেশের উপর ইতিবাচক প্রভাব ফেলে।\n\n2.  **দুপুরের খাবারের জন্য:**\n    *   **দই ভাত:** দই, শসা, গাজর এবং সামান্য লবণ দিয়ে মিশিয়ে দই ভাত তৈরি করতে পারেন। এটি গরমের জন্য খুবই освежающий।\n        *   খরচ: ২০-২৫ টাকা (দই, শসা, গাজর)।\n    *   **লেবু ভাত:** লেবুর রস, কারি পাতা, সরিষা এবং বাদাম দিয়ে লেবু ভাত তৈরি করতে পারেন।\n        *   খরচ: ২৫-৩০ টাকা (লেবুর রস, কারি পাতা, সরিষা এবং বাদাম)।\n\n3.  **রাতের খাবারের জন্য:**\n    *   **সবজি খিচুড়ি:** সবজি এবং ডাল দিয়ে খিচুড়ি রান্না করতে পারেন। এতে আপনার প্রয়োজনীয় পুষ্টি উপাদান থাকবে।\n        *   খরচ: ৫০-৬০ টাকা (সবজি ও ডাল)।\n        *   পুষ্টিগুণ: ফাইবার এবং প্রোটিন সমৃদ্ধ।\n\n**অতিরিক্ত পরামর্শ:**\n\n*   আপনি যদি চান, আমি আপনাকে স্থানীয় খাবার বিতরণের নেটওয়ার্কের সাথে যোগাযোগ করিয়ে দিতে পারি, যেখানে আপনি অতিরিক্ত খাবার দান করতে পারবেন।\n*   আপনার SDG স্কোর বাড়ানোর জন্য, আমি আপনাকে সাশ্রয়ী মূল্যের এবং পুষ্টিকর খাবারের একটি তালিকা দিতে পারি।\n\nযদি আপনার উপরের কোনো বিষয়ে আরো কিছু জানার থাকে, তাহলে জিজ্ঞাসা করতে পারেন।\n",
      "intent": "general",
      "userPreferences": {
        "language": "English",
        "budget": "low",
        "dietaryPreferences": [
          "Vegetarian"
        ],
        "familySize": 5,
        "allergies": [],
        "location": "Bangladesh"
      }
    }
  ],
  "statistics": {
    "totalWasteReduced": 0,
    "mealsPlanedCount": 0,
    "messagesCount": 2,
    "sdgScore": 50
  }
}