{
  "userId": "user_high_budget",
  "createdAt": "2025-11-21T10:17:03.082Z",
  "lastActive": "2025-11-21T10:17:16.592Z",
  "preferences": {
    "language": "English",
    "budget": "high",
    "dietaryPreferences": [
      "Non-vegetarian"
    ],
    "familySize": 2,
    "allergies": [],
    "location": "Bangladesh"
  },
  "inventory": [],
  "conversationHistory": [
    {
      "id": "msg_1763720236592",
      "timestamp": "2025-11-21T10:17:16.592Z",
      "userMessage": "আমার কাছে প্রিমিয়াম মাছ আছে, কীভাবে রান্না করব?",
      "botResponse": "আসসালামু আলাইকুম! আপনার কাছে যেহেতু প্রিমিয়াম মাছ আছে, তাহলে দারুণ কিছু রান্না করা যেতে পারে। যেহেতু আপনার বাজেট ভালো এবং আপনারা দুইজন মানুষ, তাই মাছের স্বাদ ও পুষ্টিগুণ বজায় রেখে কিছু রেসিপি দেওয়া যেতে পারে।\n\nএখানে দুটি বিকল্প দেওয়া হলো:\n\n১. **ভাপা ইলিশ (১ কেজি ইলিশ মাছের জন্য আনুমানিক খরচ: ৭০০-৯০০ টাকা):**\n\n*   **উপকরণ:** ইলিশ মাছ, সরিষার তেল, কাঁচা লঙ্কা, সরিষার পেস্ট, নারকেল কোরানো, লবণ, হলুদ।\n*   **প্রণালী:** প্রথমে মাছের টুকরোগুলোকে লবণ ও হলুদ দিয়ে মাখিয়ে নিন। তারপর সরিষার পেস্ট, নারকেল কোরা, কাঁচা লঙ্কা এবং সরিষার তেল দিয়ে ভালো করে মিশিয়ে মাছের সাথে মেখে টিফিন বক্সে ভরে নিন। টিফিন বক্সটি ভাপে বসিয়ে ২০-২৫ মিনিট রান্না করুন।\n*   **পরিবেশগত প্রভাব:** ইলিশ মাছ স্থানীয়ভাবে পাওয়া যায়, তাই এর কার্বন ফুটপ্রিন্ট কম।\n\n২. **মাছ ভাজা ও সবজি (৫০০ গ্রাম মাছের জন্য আনুমানিক খরচ: ৫০০-৭০০ টাকা + সবজির জন্য ১০০-২০০ টাকা):**\n\n*   **উপকরণ:** মাছ (যেমন রূপচাঁদা বা কোরাল), আপনার পছন্দের সবজি (যেমন পটল, ঢ্যাঁড়স, বেগুন), তেল, লবণ, হলুদ, পেঁয়াজ, রসুন, আদা বাটা, কাঁচা লঙ্কা।\n*   **প্রণালী:** প্রথমে মাছ ভেজে তুলে নিন। তারপর সবজিগুলো কেটে সামান্য লবণ ও হলুদ দিয়ে ভেজে নিন। এরপর পেঁয়াজ, রসুন, আদা বাটা ও কাঁচালঙ্কা দিয়ে মশলা তৈরি করে সবজির সাথে মিশিয়ে কিছুক্ষণ রান্না করুন। মাছ ভাজার সময় যে তেল থাকবে, তা ব্যবহার করলে স্বাদ আরও বাড়বে।\n*   **পরিবেশগত প্রভাব:** স্থানীয় সবজি ব্যবহার করলে তা পরিবেশের জন্য ভালো, কারণ এতে পরিবহন খরচ কম লাগে।\n\nএই খাবারগুলো পরিবেশ-বান্ধব উপায়ে তৈরি করা যায়।\n\nএছাড়াও, আপনি যদি মাছ সংরক্ষণের বিষয়ে জানতে চান অথবা বাজেট-বান্ধব উপায়ে খাবার তৈরি করতে চান, তাহলে আমি আপনাকে সাহায্য করতে পারি। আপনার SDG স্কোর বাড়ানোর জন্য স্বাস্থ্যকর এবং অপচয় কম হয় এমন খাবার বেছে নেওয়া দরকার। আপনি চাইলে আমি আপনার জন্য একটি সাপ্তাহিক খাবার তালিকা তৈরি করতে পারি, যা আপনার বাজেট এবং স্বাস্থ্যের জন্য ভালো হবে।",
      "intent": "general",
      "userPreferences": {
        "language": "English",
        "budget": "high",
        "dietaryPreferences": [
          "Non-vegetarian"
        ],
        "familySize": 2,
        "allergies": [],
        "location": "Bangladesh"
      }
    }
  ],
  "statistics": {
    "totalWasteReduced": 0,
    "mealsPlanedCount": 0,
    "messagesCount": 1,
    "sdgScore": 50
  }
}