{
  "userId": "user_low_budget",
  "createdAt": "2025-11-21T10:17:03.059Z",
  "lastActive": "2025-11-21T10:17:10.345Z",
  "preferences": {
    "language": "English",
    "budget": "low",
    "dietaryPreferences": [
      "Vegetarian"
    ],
    "familySize": 5,
    "allergies": [
      "Peanuts"
    ],
    "location": "Bangladesh"
  },
  "inventory": [],
  "conversationHistory": [
    {
      "id": "msg_1763720229411",
      "timestamp": "2025-11-21T10:17:09.411Z",
      "userMessage": "আমার ডাল খারাপ হয়ে যাচ্ছে",
      "botResponse": "আসসালামু আলাইকুম! ডাল নষ্ট হয়ে যাওয়াটা খুবই চিন্তার বিষয়, বিশেষ করে যখন আমরা সাশ্রয়ী হওয়ার চেষ্টা করছি। চিন্তা করবেন না, আমি আপনাকে সাহায্য করতে প্রস্তুত।\n\nডাল নষ্ট হওয়ার কয়েকটি কারণ হতে পারে, যেমন -\n\n১.  আর্দ্রতা: ডাল আর্দ্র জায়গায় রাখলে খুব তাড়াতাড়ি নষ্ট হয়ে যায়।\n২.  পোকা: ডালে পোকা লাগলে এটি দ্রুত খারাপ হয়ে যায়।\n৩.  পুরোনো ডাল: অনেকদিন ধরে ডাল রাখলে এর গুণাগুণ কমে যায় এবং নষ্ট হয়ে যেতে পারে।\n\nআপনার ডাল রক্ষা করার জন্য কিছু টিপস:\n\n*   **সঠিক পাত্রে সংরক্ষণ করুন:** ডাল সবসময় এয়ারটাইট পাত্রে রাখুন। কাঁচের পাত্র ব্যবহার করতে পারলে ভালো, কারণ এতে পোকা লাগার সম্ভাবনা কম থাকে। পাত্রগুলো শুকনো ও পরিষ্কার থাকতে হবে।\n\n    *   **খরচ:** একটি ভালো মানের এয়ারটাইট পাত্রের দাম প্রায় ১৫০-২৫০ টাকা হতে পারে।\n    *   **পরিবেশগত প্রভাব:** প্লাস্টিকের পাত্রের চেয়ে কাঁচের পাত্র ব্যবহার করলে পরিবেশের জন্য ভালো।\n\n*   **রোদে শুকিয়ে নিন:** ডাল মাঝে মাঝে রোদে শুকিয়ে নিলে পোকা লাগার সম্ভাবনা কমে যায়। রোদে দেওয়ার আগে ডালে সামান্য সরিষার তেল মাখিয়ে নিতে পারেন।\n\n    *   **খরচ:** এই পদ্ধতিতে তেমন কোনো খরচ নেই।\n    *   **পরিবেশগত প্রভাব:** সূর্যের আলো ব্যবহার করার ফলে বিদ্যুতের ব্যবহার কম হয়, যা পরিবেশের জন্য ভালো।\n\n*   **তেজপাতা ব্যবহার করুন:** ডালের পাত্রে কয়েকটি তেজপাতা দিয়ে রাখলে পোকা দূরে থাকে। তেজপাতার গন্ধ পোকা তাড়াতে সাহায্য করে।\n\n    *   **খরচ:** তেজপাতা সাধারণত ১০-২০ টাকা দামে বাজারে কিনতে পাওয়া যায়।\n    *   **পরিবেশগত প্রভাব:** এটি একটি প্রাকৃতিক উপায়, তাই পরিবেশের জন্য ক্ষতিকর নয়।\n\nআপনার SDG স্কোর ৫০/১০০, তাই খাবারের অপচয় কমানো এবং সাশ্রয়ী হওয়া আপনার জন্য গুরুত্বপূর্ণ। ডাল সংরক্ষণের এই পদ্ধতিগুলো অবলম্বন করে আপনি আপনার খাবারের অপচয় কমাতে পারেন এবং আপনার স্কোর বাড়াতে পারেন।\n\nএছাড়াও, আপনি যদি চান, আমি আপনাকে ডাল দিয়ে কিছু সহজ এবং সাশ্রয়ী রেসিপি দিতে পারি, যা আপনার পরিবারের জন্য পুষ্টিকর হবে। অথবা, আপনি কিভাবে আপনার অন্যান্য খাবার সংরক্ষণ করতে পারেন সে বিষয়েও পরামর্শ দিতে পারি। আপনার প্রয়োজন অনুযায়ী, আমি সবসময় আপনার পাশে আছি!\n",
      "intent": "general",
      "userPreferences": {
        "language": "English",
        "budget": "low",
        "dietaryPreferences": [
          "Vegetarian"
        ],
        "familySize": 5,
        "allergies": [
          "Peanuts"
        ],
        "location": "Bangladesh"
      }
    },
    {
      "id": "msg_1763720230345",
      "timestamp": "2025-11-21T10:17:10.345Z",
      "userMessage": "আমার ডাল খারাপ হয়ে যাচ্ছে",
      "botResponse": "আসসালামু আলাইকুম! ডাল নষ্ট হয়ে যাওয়াটা খুবই হতাশাজনক, বিশেষ করে যখন আমরা সীমিত বাজেট নিয়ে চলি। চিন্তা করবেন না, আমি আপনাকে সাহায্য করতে এসেছি।\n\nডাল নষ্ট হওয়ার কয়েকটি কারণ থাকতে পারে, যেমন -\n\n*   **আর্দ্রতা:** ডালের মধ্যে জলীয় বাষ্প ঢুকলে তা দ্রুত নষ্ট হয়ে যায়।\n*   **পোকা:** পোকা লাগলে ডাল নষ্ট হয়ে যায়।\n*   **সংরক্ষণ পদ্ধতি:** ভুল পদ্ধতিতে সংরক্ষণ করলে ডাল দ্রুত নষ্ট হয়ে যায়।\n\nআপনার ডাল নষ্ট হওয়া থেকে বাঁচাতে আমি কিছু পরামর্শ দিতে পারি:\n\n1.  **রোদে শুকানো:** ডাল রোদে কিছুক্ষণ শুকিয়ে নিন। এতে ডালের মধ্যে থাকা আর্দ্রতা কমে যাবে এবং ডাল ভালো থাকবে।\n    *   পরিবেশের প্রভাব: ডাল রোদে শুকালে তা প্রাকৃতিকভাবে জীবাণুমুক্ত হয়, যা রাসায়নিক ব্যবহার করার চেয়ে পরিবেশের জন্য ভালো।\n2.  **বায়ুরোধী পাত্রে সংরক্ষণ:** ডাল সবসময় বায়ুরোধী পাত্রে সংরক্ষণ করুন। এতে ডালের মধ্যে বাতাস ঢুকতে পারবে না এবং ডাল অনেকদিন পর্যন্ত ভালো থাকবে।\n3.  **নিম পাতা ব্যবহার:** ডালের পাত্রে কয়েকটি নিম পাতা রেখে দিন। নিম পাতা পোকা দূর করতে সাহায্য করে এবং ডালকে সুরক্ষিত রাখে।\n    *   বিকল্প: তেজপাতা বা শুকনো মরিচও ব্যবহার করতে পারেন।\n4.  **ফ্রিজে সংরক্ষণ:** যদি সম্ভব হয়, ডাল ফ্রিজে সংরক্ষণ করুন। ফ্রিজে ডাল অনেকদিন পর্যন্ত ভালো থাকে।\n\nএই টিপসগুলো অনুসরণ করে আপনি আপনার ডালকে দীর্ঘদিন পর্যন্ত সুরক্ষিত রাখতে পারবেন।\n\nআমি আপনাকে আর কিভাবে সাহায্য করতে পারি? আপনি যদি চান, আমি আপনাকে ডাল দিয়ে কিছু সহজ ও সাশ্রয়ী রেসিপি দিতে পারি অথবা আপনার এলাকায় খাবার শেয়ারিং নেটওয়ার্ক সম্পর্কে তথ্য দিতে পারি।",
      "intent": "general",
      "userPreferences": {
        "language": "English",
        "budget": "low",
        "dietaryPreferences": [
          "Vegetarian"
        ],
        "familySize": 5,
        "allergies": [
          "Peanuts"
        ],
        "location": "Bangladesh"
      }
    }
  ],
  "statistics": {
    "totalWasteReduced": 0,
    "mealsPlanedCount": 0,
    "messagesCount": 2,
    "sdgScore": 50
  }
}